const data = [
  {
    ដកស្រង់: "អ្វីដែលអ្នកធ្វើនៅថ្ងៃនេះអាចធ្វើអោយប្រសើរឡើងនូវផ្នូររបស់អ្នក",
    អ្នកនិពន្ធ: "Ralph Marston",
  },
  {
    ដកស្រង់:
      "អ្វីដែលអ្នកទទួលបានដោយការសម្រេចគោលដៅរបស់អ្នកគឺមិនសំខាន់ដូចអ្វីដែលអ្នកក្លាយជាដោយការសំរេចគោលដៅរបស់អ្នកទេ",
    អ្នកនិពន្ធ: "ហ្ស៊ីជីហ្សីឡា",
  },
  {
    ការដកស្រង់:
      "គន្លឹះគឺត្រូវរក្សាទំនាក់ទំនងតែជាមួយមនុស្សដែលលើកស្ទួយអ្នកដែលវត្តមានរបស់អ្នកអំពាវនាវឱ្យអ្នកល្អបំផុត",
    អ្នកនិពន្ធ: "Epictetus",
  },
  {
    ដកស្រង់: "យើងអាចជួបប្រទះការបរាជ័យជាច្រើនប៉ុន្តែយើងមិនត្រូវចាញ់ឡើយ",
    អ្នកនិពន្ធ: "ឧសភា Angelou",
  },
  {
    សម្រង់: "បញ្ហាមិនមែនជាសញ្ញាបញ្ឈប់ទេវាជាគោលការណ៍ណែនាំ",
    អ្នកនិពន្ធ: "រ៉ូបឺតអិចស្ហូឡឺរ",
  },
  {
    ដកស្រង់: "មានចិត្តល្អនៅពេលណាដែលអាចធ្វើបាន។ វាតែងតែអាចធ្វើទៅបាន។ ",
    អ្នកនិពន្ធ: "ដាឡៃឡាម៉ា",
  },
  {
    ដកស្រង់:
      "បុរសច្នៃប្រឌិតម្នាក់ត្រូវបានជំរុញដោយបំណងប្រាថ្នាដើម្បីសម្រេចបានមិនមែនដោយបំណងចង់ផ្តួលអ្នកដទៃ",
    អ្នកនិពន្ធ: "អាន់រ៉ាន់",
  },
  {
    ដកស្រង់: "នរណាម្នាក់ធ្លាប់ជាអ្នកដែលមិនចង់ធ្វើនិងធ្វើ",
    អ្នកនិពន្ធ: "ចនប៊ឺហ្គឺស៍",
  },
  {
    ដកស្រង់:
      "ជីវិតគឺ ១០% អ្វីដែលកើតឡើងចំពោះយើងនិង ៩០% ដែលយើងមានប្រតិកម្មចំពោះវា",
    អ្នកនិពន្ធ: "ឌេននីសភីគីមបូរ៉ូ",
  },
  {
    ដកស្រង់: "ទោះបីអ្នកនៅលើផ្លូវត្រូវក៏ដោយអ្នកនឹងរត់ទៅបានបើអ្នកអង្គុយនៅទីនោះ។ ",
    អ្នកនិពន្ធ: "នឹងលោក Rogers",
  },
  {
    ដកស្រង់: "សំណាងគឺជាភាគលាភនៃញើស។ អ្នកបែកញើសកាន់តែច្រើនអ្នកនឹងកាន់តែមានសំណាង",
    អ្នកនិពន្ធ: "រ៉េខេក្រក",
  },
  {
    សម្រង់:
      "ភាពក្លាហានគឺជាគុណសម្បត្ដិទីមួយរបស់មនុស្សពីព្រោះវាជាគុណភាពដែលធានាដល់អ្នកដទៃ",
    អ្នកនិពន្ធ: "វីនស្តុន Churchill",
  },
  {
    ដកស្រង់:
      "រឿងដ៏អស្ចារ្យនៅក្នុងពិភពលោកនេះមិនមានច្រើនទេដែលអ្នកឈរដូចទិសដៅដែលអ្នកកំពុងផ្លាស់ប្តូរ",
    អ្នកនិពន្ធ: "អូលីវើរវេនហូលស៍",
  },
  {
    ដកស្រង់:
      "ទោះបីជាគ្មាននរណាម្នាក់អាចថយក្រោយនិងបង្កើតការចាប់ផ្តើមថ្មីបានក៏ដោយក៏អ្នកណាម្នាក់អាចចាប់ផ្តើមពីពេលនេះហើយធ្វើឱ្យម៉ាកថ្មីបញ្ចប់",
    អ្នកនិពន្ធ: "ខាឡិន Bard",
  },
];

// console.log(data)

const testObj = {
  ដកស្រង់:
    "ទោះបីជាគ្មាននរណាម្នាក់អាចថយក្រោយនិងបង្កើតការចាប់ផ្តើមថ្មីបានក៏ដោយក៏អ្នកណាម្នាក់អាចចាប់ផ្តើមពីពេលនេះហើយធ្វើឱ្យម៉ាកថ្មីបញ្ចប់",
  អ្នកនិពន្ធ: "ខាឡិន Bard",
};

// console.log(testObj["ដកស្រង់"])

let newData = data.map((data) => {
  return {
    quotesKH: data["ដកស្រង់"],
    author: data["អ្នកនិពន្ធ"],
  };
});

console.log(newData);
